Revit 2027 API
VertexPositionNormal Constructor
 Constructs the vertex from a point and a normal vector.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexPositionNormal(
	XYZ position,
	XYZ normal
)
Public Sub New (
	position As XYZ,
	normal As XYZ
)
public:
VertexPositionNormal(
	XYZ^ position,
	XYZ^ normal
)
new :
        position : XYZ *
        normal : XYZ -> VertexPositionNormal
Parameters
position XYZ
 The vertex's position.
normal XYZ
 The vertex's normal vector.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
VertexPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace